MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX664F064H.atdf
         <register caption="" name="Config1" offset="0xb4" rw="R" size="4">
            <bitfield mask="0x00000001" name="FP" />
            <bitfield mask="0x00000002" name="EP" />
            <bitfield mask="0x00000004" name="CA" />
            <bitfield mask="0x00000008" name="WR" />
            <bitfield mask="0x00000010" name="PC" />
            <bitfield mask="0x00000020" name="MD" />
            <bitfield mask="0x00000040" name="C2" />
            <bitfield mask="0x00000380" name="DA" />
            <bitfield mask="0x00001C00" name="DL" />
            <bitfield mask="0x0000E000" name="DS" />
            <bitfield mask="0x00070000" name="IA" />
            <bitfield mask="0x00380000" name="IL" />
            <bitfield mask="0x01C00000" name="IS" />
            <bitfield mask="0x7E000000" name="MMUsz" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config2" offset="0xb8" rw="R" size="4">
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config3" offset="0xbc" rw="R" size="4">
            <bitfield mask="0x00000001" name="TL" />
            <bitfield mask="0x00000002" name="SM" />
            <bitfield mask="0x00000010" name="SP" />
            <bitfield mask="0x00000020" name="VInt" />
            <bitfield mask="0x00000040" name="VEIC" />
            <bitfield mask="0x00000100" name="ITL" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Debug" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="DSS" />
            <bitfield mask="0x00000002" name="DBp" />
            <bitfield mask="0x00000004" name="DDBL" />
            <bitfield mask="0x00000008" name="DDBS" />
            <bitfield mask="0x00000010" name="DIB" />
            <bitfield mask="0x00000020" name="DINT" />
            <bitfield mask="0x000000C0" name="R" />
            <bitfield mask="0x00000100" name="SSt" />
            <bitfield mask="0x00000200" name="NoSST" />
            <bitfield mask="0x00007C00" name="DExcCode" />
            <bitfield mask="0x00038000" name="Ver" />
            <bitfield mask="0x00040000" name="DDBLImpr" />
            <bitfield mask="0x00080000" name="DDBSImpr" />
            <bitfield mask="0x00100000" name="IEXI" />
            <bitfield mask="0x00200000" name="DBusEP" />
            <bitfield mask="0x00400000" name="CacheEP" />
            <bitfield mask="0x00800000" name="MCheckP" />
            <bitfield mask="0x01000000" name="IBusEP" />
            <bitfield mask="0x02000000" name="CountDM" />
            <bitfield mask="0x04000000" name="Halt" />
            <bitfield mask="0x08000000" name="Doze" />
            <bitfield mask="0x10000000" name="LSNM" />
            <bitfield mask="0x20000000" name="NoDCR" />
            <bitfield mask="0x40000000" name="DM" />
            <bitfield mask="0x80000000" name="DBD" />
         </register>
         <register caption="" name="TraceControl" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x00000001" name="On" />
            <bitfield mask="0x0000000E" name="Mode" />
            <bitfield mask="0x00000010" name="G" />
            <bitfield mask="0x00001FE0" name="ASID" />
            <bitfield mask="0x001FE000" name="ASID_M" />
            <bitfield mask="0x00200000" name="U" />
            <bitfield mask="0x00400000" name="S" />
            <bitfield mask="0x00800000" name="K" />
            <bitfield mask="0x01000000" name="E" />
            <bitfield mask="0x02000000" name="D" />
            <bitfield mask="0x04000000" name="IO" />
            <bitfield mask="0x08000000" name="TB" />
            <bitfield mask="0x40000000" name="UT" />
            <bitfield mask="0x80000000" name="TS" />
         </register>
         <register caption="" name="TraceControl2" offset="0xc8" rw="R" size="4">
            <bitfield mask="0x00000007" name="SyP" />
            <bitfield mask="0x00000008" name="TBU" />
            <bitfield mask="0x00000010" name="TBI" />
            <bitfield mask="0x00000060" name="ValidModes" />
         </register>
         <register caption="" name="UserTraceData" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Data" />
         </register>
         <register caption="" name="TraceBPC" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IBPOn" />
            <bitfield mask="0x00008000" name="IE" />
            <bitfield mask="0x00030000" name="DBPOn" />
            <bitfield mask="0x80000000" name="DE" />
         </register>
         <register caption="" name="Debug2" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="debug2" />
         </register>
         <register caption="" name="DEPC" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DEPC" />
         </register>
         <register caption="" name="ErrorEPC" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ErrorEPC" />
         </register>
         <register caption="" name="DESAVE" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DESAVE" />
         </register>
         <register caption="" name="lo" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUlow" />
         </register>
         <register caption="" name="hi" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUhigh" />
         </register>
      </register-group>
   </module>
   <module caption="" id="00800" name="CVR" version="1">
      <register-group name="CVR">
         <register caption="Comparator Voltage Reference Control Register" name="CVRCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="CVref Value Selection" mask="0x0000000F" name="CVR" values="CVRCON__CVR" />
            <bitfield caption="CVref Source Selection bit" mask="0x00000010" name="CVRSS" values="CVRCON__CVRSS" />
            <bitfield caption="CVref Range Selection bit" mask="0x00000020" name="CVRR" values="CVRCON__CVRR" />
            <bitfield caption="CVrefout Enable bit" mask="0x00000040" name="CVROE" values="CVRCON__CVROE" />
            <bitfield caption="Band Gap Reference Source bits" mask="0x00000300" name="BGSEL" values="CVRCON__BGSEL" />
            <bitfield caption="Voltage Reference Select bit" mask="0x00000400" name="VREFSEL" values="CVRCON__VREFSEL" />
            <bitfield caption="Comparator Voltage Reference On bit" mask="0x00008000" name="ON" values="CVRCON__ON" />
         </register>
      </register-group>
      <value-group caption="CVref Value Selection" name="CVRCON__CVR">
         <value caption="(When CVRR is 1) CVREF is (15/24) * CVRSRC / (When CVRR is 0) CVREF is (23/32)*CVRSRC" name="" value="0xf" />
         <value caption="(When CVRR is 1) CVREF is (14/24) * CVRSRC / (When CVRR is 0) CVREF is (22/32)*CVRSRC" name="" value="0xe" />
         <value caption="(When CVRR is 1) CVREF is (13/24) * CVRSRC / (When CVRR is 0) CVREF is (21/32)*CVRSRC" name="" value="0xd" />
         <value caption="(When CVRR is 1) CVREF is (12/24) * CVRSRC / (When CVRR is 0) CVREF is (20/32)*CVRSRC" name="" value="0xc" />
         <value caption="(When CVRR is 1) CVREF is (11/24) * CVRSRC / (When CVRR is 0) CVREF is (19/32)*CVRSRC" name="" value="0xb" />
         <value caption="(When CVRR is 1) CVREF is (10/24) * CVRSRC / (When CVRR is 0) CVREF is (18/32)*CVRSRC" name="" value="0xa" />
         <value caption="(When CVRR is 1) CVREF is (9/24) * CVRSRC / (When CVRR is 0) CVREF is (17/32)*CVRSRC" name="" value="0x9" />
         <value caption="(When CVRR is 1) CVREF is (8/24) * CVRSRC / (When CVRR is 0) CVREF is (16/32)*CVRSRC" name="" value="0x8" />
         <value caption="(When CVRR is 1) CVREF is (7/24) * CVRSRC / (When CVRR is 0) CVREF is (15/32)*CVRSRC" name="" value="0x7" />
         <value caption="(When CVRR is 1) CVREF is (6/24) * CVRSRC / (When CVRR is 0) CVREF is (14/32)*CVRSRC" name="" value="0x6" />
         <value caption="(When CVRR is 1) CVREF is (5/24) * CVRSRC / (When CVRR is 0) CVREF is (13/32)*CVRSRC" name="" value="0x5" />
         <value caption="(When CVRR is 1) CVREF is (4/24) * CVRSRC / (When CVRR is 0) CVREF is (12/32)*CVRSRC" name="" value="0x4" />
         <value caption="(When CVRR is 1) CVREF is (3/24) * CVRSRC / (When CVRR is 0) CVREF is (11/32)*CVRSRC" name="" value="0x3" />
         <value caption="(When CVRR is 1) CVREF is (2/24) * CVRSRC / (When CVRR is 0) CVREF is (10/32)*CVRSRC" name="" value="0x2" />
         <value caption="(When CVRR is 1) CVREF is (1/24) * CVRSRC / (When CVRR is 0) CVREF is (9/32)*CVRSRC" name="" value="0x1" />
         <value caption="(When CVRR is 1) CVREF is (0/24) * CVRSRC / (When CVRR is 0) CVREF is (8/32)*CVRSRC" name="" value="0x0" />
      </value-group>
      <value-group caption="CVref Source Selection bit" name="CVRCON__CVRSS">
         <value caption="Comparator voltage reference source CVrsrc = (Vref+) - (Vref-)" name="" value="0x1" />
         <value caption="Comparator voltage reference source CVrsrc = AVdd - AVss" name="" value="0x0" />
      </value-group>
